app/views/passwords/index.html.erb

                        <h3 class="mb-0">Saved Passwords</h3>
                        <span class="badge bg-info text-dark"><%= pluralize(@passwords.count, "Password") %></span>
---
SELECT "passwords".* FROM "passwords"
SELECT COUNT(*) FROM "passwords"