app/controllers/passwords_controller.rb

DELETE FROM "passwords" WHERE "passwords"."id" = 9
---
    def destroy
        @password = Password.find(params[:id])
        if @password.destroy