app/controllers/passwords_controller.rb

SELECT "passwords".* FROM "passwords" WHERE "passwords"."user_id" IS NULL
---
    def index
        @password = Password.new
        @user_id = params[:id]
        @passwords = Password.where(user_id: @user_id)

INSERT INTO "passwords" ("user_id", "password", "website_url", "website_name", "created_at", "updated_at", "username") VALUES ('3', 'rohitkdm', 'www.youtube.com', 'youtube', '2025-09-13 10:13:54.903608', '2025-09-13 10:13:54.903608', 'rohit') RETURNING "id"
---
    def create
        @password = Password.new(password_params)
        if @password.save

SELECT "passwords".* FROM "passwords" WHERE "passwords"."id" = 9 LIMIT 1
SELECT "password_histories".* FROM "password_histories" WHERE "password_histories"."password_id" = '12' ORDER BY "password_histories"."created_at" DESC
---
    def edit
        @password = Password.find(params[:id])
        @histories = PasswordHistory.where(password_id: @password.id).order(created_at: :desc)

SELECT "passwords".* FROM "passwords" WHERE "passwords"."id" = 12 LIMIT 1
UPDATE "passwords" SET "password" = 'rohitBhauKiJayHo', "updated_at" = '2025-09-14 08:05:02.349574' WHERE "passwords"."id" = 12
INSERT INTO "password_histories" ("password_id", "old_password", "new_password", "created_at", "updated_at") VALUES ('12', 'asdads', 'rohitBhauKiJayHo', '2025-09-14 08:05:02.475072', '2025-09-14 08:05:02.475072') RETURNING "id"
SELECT "password_histories".* FROM "password_histories" WHERE "password_histories"."password_id" = '13' ORDER BY "password_histories"."created_at" DESC
---
    def update
        @password = Password.find(params[:id])
        old_password = @password.password
        new_password = params[:password][:new_password]

        if @password.update(password: new_password)
            PasswordHistory.create!(
            password_id: @password.id,
            old_password: old_password,
            new_password: new_password
            )
            redirect_to passwords_index_path(id: @password.user_id), notice: 'Password was successfully updated.'
        else
            @histories = PasswordHistory.where(password_id: @password.id).order(created_at: :desc)

SELECT "passwords".* FROM "passwords" WHERE "passwords"."id" = 13 LIMIT 1
DELETE FROM "passwords" WHERE "passwords"."id" = 9
---
    def destroy
        @password = Password.find(params[:id])
        if @password.destroy