app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at") VALUES (NULL, NULL, NULL, NULL, '2025-09-13 08:00:15.020387', '2025-09-13 08:00:15.020387') RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def update
        @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 1
---
    def destroy
        @user = User.find(params[:id])
        if @user.destroy