app/controllers/users_controller.rb

  def process_login
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1